archetypes/phresco-drupal6-archetype/src/main/resources/archetype-resources/test/performance/database/tests/PhrescoFrameWork_TestPlan.jmx
<?xml version="1.0" encoding="UTF-8"?><jmeterTestPlan properties="2.1" version="1.2">
  <hashTree>
    <TestPlan enabled="true" guiclass="TestPlanGui" testclass="TestPlan" testname="PhrescoFrameWork_TestPlan">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp elementType="Arguments" enabled="true" guiclass="ArgumentsPanel" name="TestPlan.user_defined_variables" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <JDBCDataSource enabled="true" guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="Database Configuration">
        <boolProp name="autocommit">true</boolProp>
        <stringProp name="checkQuery">Select 1</stringProp>
        <stringProp name="connectionAge">5000</stringProp>
        <stringProp name="dataSource">drupal7db</stringProp>
        <stringProp name="dbUrl">jdbc:mysql://localhost:3306/drupal777db</stringProp>
        <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
        <boolProp name="keepAlive">true</boolProp>
        <stringProp name="poolMax">10</stringProp>
        <stringProp name="timeout">10000</stringProp>
        <stringProp name="trimInterval">60000</stringProp>
        <stringProp name="username">root</stringProp>
      </JDBCDataSource>
      <hashTree/>
      <ThreadGroup enabled="true" guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Drupal FrameWork_JDBC Request">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp elementType="LoopController" enabled="true" guiclass="LoopControlPanel" name="ThreadGroup.main_controller" testclass="LoopController" testname="Loop Controller">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">3</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">3</stringProp>
        <stringProp name="ThreadGroup.ramp_time">3</stringProp>
        <longProp name="ThreadGroup.start_time">1326287189000</longProp>
        <longProp name="ThreadGroup.end_time">1326287189000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
<JDBCSampler enabled="true" guiclass="TestBeanGUI" testclass="JDBCSampler" testname="sample">
<stringProp name="dataSource">drupal7db</stringProp>
<stringProp name="queryType">Select Statement</stringProp>
<stringProp name="query">select * from users;</stringProp>
</JDBCSampler>
<hashTree/>
</hashTree>
      <ResultCollector enabled="true" guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="PhrescoFrameWork_TestPlan Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector enabled="true" guiclass="SummaryReport" testclass="ResultCollector" testname="PhrescoFrameWork_TestPlan Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>